#+Title: Interacting Objects
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2023-08-22
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv

* Some more on Java Strings
- A String is an /immutable object/ in Java.
- We can glue together (concatenate) strings: ~"First" + "Second"~ 
- The result, however, is a /new/ string ~"FirstSecond"~

#+begin_src java
  String f = "First";
  String s = "Second";
  f = f+s; // Create a new string "FirstSecond" and store a reference to it in f. Garbage collect the string "First".

  // Be wary of the == operator:
  String ss = "Second";
  String fs = "FirstSecond";

  System.out.println(s==ss);
  System.out.println(f==fs);

  // Instead, use equals():
  System.out.println(f.equals(fs));

  // Many concatenations drive the garbage collector into overtime.
  // Better to use a StringBuilder:
  StringBuilder sb = new StringBuilder();
  for (int i = 0; i < 1000; i++) {
    sb.append(f);
  }

  System.out.println(sb.toString());
#+end_src

#+RESULTS:
: true
: false
: true
: FirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecondFirstSecond
** Logical Operators 
#+begin_src cpp
  #include <iostream>
  using namespace std;

  bool test(int i) {
    cout << i << flush;
    return (0==i%5);
  }

  int main(void) {
    cout << (1==1)  // evaluates to 1 (anything other than zero is true);
         << ! (1==1) // NOT evaluates to 0
         << true    // evaluates to 1 
         << false   // evaluates t0 0
         << (1==1 && 1==2) // AND
         << (1==1 || 1==2) // OR
         << endl;

    // Keep evaluating until a true value is found.
    cout << (test(1) || test(2) || test(3)|| test(4)|| test(5)|| test(6)|| test(7)) << endl;

    // Keep evaluating until a false value is found.
    cout << (!test(1) && !test(2) && !test(3)&& !test(4)&& !test(5)&& !test(6)&& !test(7)) << endl;

  }
#+end_src

#+RESULTS:
| 101001 |
| 123451 |
| 123450 |
